dvhai08/tuanvu_luanvan/nrf51822/nRF51_SDK_10.0.0 - Mesh/examples/ble_peripheral/iky_sswitch_3btn/main.c

//DFU - what is "Init packet file" (*.dat) and how to get it?
//C:\Program Files (x86)\Nordic Semiconductor\Master Control Panel\3.10.0.14\nrf>
//nrfutil dfu genpkg --application myapp.hex --application-version 0xffffffff --dev-type 0xffff --dev-revision 0xffff --sd-req 0x64,0x45,0x5a myapp.zip
//Zip created at myapp.zip

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_util_platform.h"
#include "main.h"
#include "hw_config.h"
#include "CY8CMBR3xxx_APIs.h"
#include "CY8CMBR3xxx_HostFunctions.h"
#include "CY8CMBR3xxx_Registers.h"
#include "MBR3_Configuration.h"
#include "app_timer_appsh.h"
#include "app_gpiote.h"
#include "app_pwm.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "io_control.h"
#include "system_config.h"
#include "crc8.h"
#include "IKYProtocol\iky_ble_app.h"
#include "i2c_driver.h"
#include "rbc_mesh.h"
#include "mesh_comm.h"

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                128                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 80 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define TIMER_INTERVAL     							50
#define TOUCH_SCAN_INTERVAL     				APP_TIMER_TICKS(TIMER_INTERVAL, APP_TIMER_PRESCALER)
#define BUTTON_CLICK_INTERVAL     			APP_TIMER_TICKS(500, APP_TIMER_PRESCALER)
#define SYSTICK_TIMER_INTERVAL					APP_TIMER_TICKS(SYSTICK_INTERVAL, APP_TIMER_PRESCALER)

#define BOOT_MODE_ACTIVE								0x5A5A5A5A
#define BOOT_MODE_INACTIVE							0xA5A5A5A5

#define STOP_CHECK_PROXIMITY_TIMEOUT		250

#define MESH_ACCESS_ADDR        				(RBC_MESH_ACCESS_ADDRESS_BLE_ADV)   /**< Access address for the mesh to operate on. */
#define MESH_INTERVAL_MIN_MS    				(100)                               /**< Mesh minimum advertisement interval in milliseconds. */
#define MESH_CHANNEL            				(38)                                /**< BLE channel to operate on. Single channel only. */
#define MESH_CLOCK_SOURCE       				(NRF_CLOCK_LFCLKSRC_RC_250_PPM_TEMP_4000MS_CALIBRATION)    /**< Clock source used by the Softdevice. For calibrating timeslot time. */


static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */

uint32_t ioRelay_1_Status __attribute__((at(0x20003F00)));
uint32_t ioRelay_2_Status __attribute__((at(0x20003F04)));
uint32_t ioRelay_3_Status __attribute__((at(0x20003F08)));
uint32_t ioRelay_4_Status __attribute__((at(0x20003F0C)));

uint32_t bootModeFlag __attribute__((at(0x20003FFC)));

//uint8_t bHostInterruptFlag = 0;
bool CY8CMBR3xxx_isOK = false;
APP_PWM_INSTANCE(PWM1,1);

uint8_t buzzer_status = 0;
bool buzzer_ready_flag = false;

ble_gap_addr_t my_addr;

APP_TIMER_DEF(m_touch_timer_id);                                                 /**< Touch timer. */
APP_TIMER_DEF(m_btn_1_timer_id);
APP_TIMER_DEF(m_btn_2_timer_id);
APP_TIMER_DEF(m_systick_timer_id);

CY8CMBR3xxx_SENSORSTATUS sensorStatus;

Timeout_Type tTouchReinitTimeout;
Timeout_Type tStopCheckProximityTimeout;
Timeout_Type tButtonTouchTimeout;

bool m_nus_xfer_done = false;
static volatile bool ready_flag;            // A flag indicating PWM status.
LED_PROXIMITY_STATE ledProximityState = LED_PROXIMITY_OFF;

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

