dvhai08/tuanvu_luanvan/nrf51822/nRF51_SDK_10.0.0 - Mesh/examples/ble_peripheral/iky_sswitch_3btn/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
		options.ble_adv_whitelist_enabled = BLE_ADV_WHITELIST_DISABLED;
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**
* @brief RBC_MESH framework event handler. Defined in rbc_mesh.h. Handles
*   events coming from the mesh. Sets LEDs according to data
*
* @param[in] evt RBC event propagated from framework
*/
static void rbc_mesh_event_handler(rbc_mesh_event_t* p_evt)
{   
//		static const char cmd[] = {'U', 'C', 'N', 'I', 'T'};
		uint32_t      err_code;
    switch (p_evt->type)
    {
        case RBC_MESH_EVENT_TYPE_CONFLICTING_VAL:
						NRF_LOG_PRINTF("RBC_MESH_EVENT_TYPE_CONFLICTING_VAL %d\r\n",p_evt->params.rx.timestamp_us);
//						err_code = rbc_mesh_value_set(p_evt->params.rx.value_handle,&p_evt->params.rx.p_data[0],1);
//						APP_ERROR_CHECK(err_code);
						break;
				
        case RBC_MESH_EVENT_TYPE_NEW_VAL:
        case RBC_MESH_EVENT_TYPE_UPDATE_VAL:
//						NRF_LOG_PRINTF("addr[%x][%x][%x][%x][%x][%x] \r\n", p_evt->params.rx.ble_adv_addr.addr[0]
//																																, p_evt->params.rx.ble_adv_addr.addr[1]
//																																, p_evt->params.rx.ble_adv_addr.addr[2]
//																																, p_evt->params.rx.ble_adv_addr.addr[3]
//																																, p_evt->params.rx.ble_adv_addr.addr[4]
//																																, p_evt->params.rx.ble_adv_addr.addr[5]);
//						NRF_LOG_PRINTF("event %c handle %d length %d \r\n", cmd[p_evt->type], p_evt->params.rx.value_handle,p_evt->params.rx.data_len);
//            NRF_LOG_PRINTF("%c[%d] \r\n", cmd[p_evt->type], p_evt->params.rx.value_handle);
						if(p_evt->params.rx.data_len == sizeof(mesh_comm_payload_t) && (mesh_comm_address_is_valid(p_evt->params.rx.p_data) == NRF_SUCCESS))
						{							
							mesh_comm_parser_payload((mesh_comm_payload_t *) p_evt->params.rx.p_data);
							
							err_code = rbc_mesh_value_set(p_evt->params.rx.value_handle,(uint8_t*)&mesh_comm_tx_payload,sizeof(mesh_comm_payload_t));
							APP_ERROR_CHECK(err_code);
						}
//						else
//						{
//							err_code = rbc_mesh_value_set(p_evt->params.rx.value_handle,&p_evt->params.rx.p_data[0],1);
//							APP_ERROR_CHECK(err_code);
//						}
            break;

        case RBC_MESH_EVENT_TYPE_TX:
//						NRF_LOG_PRINTF("RBC_MESH_EVENT_TYPE_TX\r\n");
            break;
				
        default:
            break;
    }
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static void wdt_init(void)
{
	NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
	NRF_WDT->CRV = 3*32768;   //ca 3 sek. timout
	NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
	NRF_WDT->TASKS_START = 1;
}

static void wdt_reload(void)
{
	NRF_WDT->RR[0] = WDT_RR_RR_Reload; //Reload watchdog register 0
}
/**@brief Application main function.
 */
int main(void)
{
    uint32_t 	err_code;
		uint32_t value;
		rbc_mesh_event_t evt;	
	
		bootModeFlag = BOOT_MODE_INACTIVE;
    // Initialize.
		io_control_init();
	
		timers_init();	
    ble_stack_init();
		sd_ble_gap_address_get(&my_addr);
	
		rbc_mesh_init_params_t init_params;

    init_params.access_addr = MESH_ACCESS_ADDR;
    init_params.interval_min_ms = MESH_INTERVAL_MIN_MS;
    init_params.channel = MESH_CHANNEL;
    init_params.lfclksrc = MESH_CLOCK_SOURCE;
    init_params.tx_power = RBC_MESH_TXPOWER_Pos4dBm ;
    
    uint32_t error_code = rbc_mesh_init(init_params);
    APP_ERROR_CHECK(error_code);
	
		CFG_Load();
		wdt_init();
		wdt_reload();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		
		NRF_LOG_INIT();
		NRF_LOG_PRINTF("IO INIT %x\r\n",PSTORAGE_DATA_START_ADDR);
		IKY_BLE_TaskInit();
	
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
    IOFilter_Init(&io_btn_1,NORMAL_FILTER_CNT,0,button_1_update_event_handler);
		IOFilter_Init(&io_btn_2,NORMAL_FILTER_CNT,0,button_2_update_event_handler);
		IOFilter_Init(&io_btn_3,NORMAL_FILTER_CNT,0,button_3_update_event_handler);
		IOFilter_Init(&io_proximity_1,PROXIMITY_FILTER_CNT,0,proximity_1_update_event_handler);
		
		boards_init();
		twi_init();
		
		NRF_LOG_PRINTF("Fw: %s\r\n",FW_RELEASE_DATE);
		update_mesh_comm_address();
		/* request values for both LEDs on the mesh */
		error_code = rbc_mesh_value_enable(1);
		APP_ERROR_CHECK(error_code);
		error_code = rbc_mesh_tx_event_set(1,true);
		APP_ERROR_CHECK(error_code);
		
		nrf_delay_ms(500);
		
		if (TRUE == CY8CMBR3xxx_Configure(SLAVE_ADDRESS, &CY8CMBR3108_LQXI_configuration[0]))
    {
			NRF_LOG_PRINTF(" OK\r\n");
			CY8CMBR3xxx_isOK = true;		

			IO_ToggleSetStatus(&io_led_red_1,50,50,IO_TOGGLE_ENABLE,1);			
			IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,2);
    }
		else
		{
			NRF_LOG_PRINTF(" ERROR\r\n");	
			CY8CMBR3xxx_isOK = false;
			
			IO_ToggleSetStatus(&io_led_red_1,50,50,IO_TOGGLE_ENABLE,10);
			IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,5);
		}
		InitTimeout(&tTouchReinitTimeout,SYSTICK_TIME_SEC(3));
		NRF_LOG_PRINTF("START\r\n");
		application_timers_start();
		InitTimeout(&tButtonTouchTimeout,SYSTICK_TIME_SEC(10));
    // Enter main loop.
    for (;;)
    {
				wdt_reload();
				if(bootModeFlag == BOOT_MODE_ACTIVE)
				{
					if(io_buzzer.enable != IO_TOGGLE_ENABLE) NVIC_SystemReset();
				}
				CFG_Save_Task();
				power_manage();
				IKY_BLE_Task();
				ble_nus_send_task();
				ResetMcuTask();
				
