dvhai08/tuanvu_luanvan/nrf51822/nRF51_SDK_10.0.0 - Mesh/examples/ble_peripheral/iky_sswitch_3btn/main.c
				if(CY8CMBR3xxx_isOK == false && CheckTimeout(&tTouchReinitTimeout) == SYSTICK_TIMEOUT)
				{
					twi_reinit();
					if (TRUE == CY8CMBR3xxx_Configure(SLAVE_ADDRESS, &CY8CMBR3108_LQXI_configuration[0]))
					{
						NRF_LOG_PRINTF(" OK 11\r\n");
						CY8CMBR3xxx_isOK = true;			
					}
					else
					{
						NRF_LOG_PRINTF(" ERROR 11\r\n");
						CY8CMBR3xxx_isOK = false;						
					}
					InitTimeout(&tTouchReinitTimeout,SYSTICK_TIME_SEC(3));
				}
				if (rbc_mesh_event_get(&evt) == NRF_SUCCESS)
        {   
            rbc_mesh_event_handler(&evt);
            rbc_mesh_event_release(&evt);
        }
				//reset password function
				if( (io_btn_1.bitOld == 0) && (io_btn_2.bitOld == 0) && (io_btn_3.bitOld == 0))
				{
					InitTimeout(&tButtonTouchTimeout,SYSTICK_TIME_SEC(10));
				}
				if(CheckTimeout(&tButtonTouchTimeout) == SYSTICK_TIMEOUT)
				{
					if(io_buzzer.enable != IO_TOGGLE_ENABLE)IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,5);
					memcpy(sysCfg.Password,DEFAULT_PASSWORD,DEVICE_PASSWORD_LENGTH);
					system_config_change = true;
					InitTimeout(&tButtonTouchTimeout,SYSTICK_TIME_SEC(10));					
				}
    }
}

void twi_init (void)
{
		#if 1	
		I2C_init();
		#else
    ret_code_t err_code;
    err_code = nrf_drv_twi_init(&m_twi_CY8CMBRxxxx, &twi_config, NULL /*Host_TWI_Handler*/, NULL);
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_twi_enable(&m_twi_CY8CMBRxxxx);
		#endif
}

void twi_reinit (void)
{
		#if 1
	
		#else
    ret_code_t err_code;
		nrf_drv_twi_uninit(&m_twi_CY8CMBRxxxx);
    err_code = nrf_drv_twi_init(&m_twi_CY8CMBRxxxx, &twi_config, NULL /*Host_TWI_Handler*/, NULL);
    APP_ERROR_CHECK(err_code);
    
    nrf_drv_twi_enable(&m_twi_CY8CMBRxxxx);
	
		#endif
}

void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
		ready_flag = true;
}

//void CY8CMBR3xxx_Event_Handler(uint32_t event_pins_low_to_high, uint32_t event_pins_high_to_low)
//{
//	bHostInterruptFlag = 1;
//}

/**
 * @brief Handler for timer events.
 */
void timer_touch_event_handler(void* p_context)
{	
	if(CY8CMBR3xxx_isOK)
	{
		if (TRUE == CY8CMBR3xxx_ReadSensorStatus(SLAVE_ADDRESS, &sensorStatus))
		{
			IOFilter_Update(&io_btn_1,sensorStatus.buttonStatus & TOUCH_CHANNEL_1_MASK);
			IOFilter_Update(&io_btn_2,sensorStatus.buttonStatus & TOUCH_CHANNEL_2_MASK);
			IOFilter_Update(&io_btn_3,sensorStatus.buttonStatus & TOUCH_CHANNEL_3_MASK);
			IOFilter_Update(&io_proximity_1,sensorStatus.proxStatus & PROXIMITY_CHANNEL_1_MASK);			
		}
		else
		{
			CY8CMBR3xxx_isOK = false;
		}
	}
	
	if(io_proximity_1.bitOld && CheckTimeout(&tStopCheckProximityTimeout) == SYSTICK_TIMEOUT)
	{
			IO_ToggleSetStatus(&io_led_red_1,1050,50,IO_TOGGLE_ENABLE,1);
	}
	
	if(IO_ToggleProcess(&io_led_red_1,TIMER_INTERVAL) == IO_STATUS_ON)
	{
		led_proximity_set_state(1);//nrf_gpio_pin_set(LED_BLUE_1);
	}
	else
	{
		led_proximity_set_state(0);//nrf_gpio_pin_clear(LED_BLUE_1);
	}
	

	if(IO_ToggleProcess(&io_buzzer,TIMER_INTERVAL) == IO_STATUS_ON)
	{
		if(buzzer_status == 0)app_pwm_channel_duty_set(&PWM1, 0, 50);
		buzzer_status = 1;
	}
	else
	{
		if(buzzer_status == 1)app_pwm_channel_duty_set(&PWM1, 0, 100);
		buzzer_status = 0;
	}
}


/**
 * @brief Handler for timer events.
 */
void out_update_event_handler(uint8_t status)
{ 
	
}

/**
 * @brief Handler for timer events.
 */
void button_1_update_event_handler(uint8_t status)
{  
	uint32_t err_code;	
	if(status)
	{
		IO_ToggleSetStatus(&io_led_red_1,3000,50,IO_TOGGLE_ENABLE,1);

		reportFlag |= OUTPUT_TOUCH_CONTROL_FLAG;
		
		IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,1);
		if(IO_ToggleStatusOnRAM(&ioRelay_1_Status))
		{
			nrf_gpio_pins_set(OUTPUT_1_MASK);
		}
		else
		{
			nrf_gpio_pins_clear(OUTPUT_1_MASK);
		}
		
		err_code = app_timer_stop(m_btn_1_timer_id);
		APP_ERROR_CHECK(err_code);
		err_code = app_timer_start(m_btn_1_timer_id, BUTTON_CLICK_INTERVAL, NULL);
		APP_ERROR_CHECK(err_code);
	}
}


/**
 * @brief Handler for timer events.
 */
void button_2_update_event_handler(uint8_t status)
{ 
	uint32_t err_code;	
	if(status)
	{
		IO_ToggleSetStatus(&io_led_red_1,3000,50,IO_TOGGLE_ENABLE,1);
		
		reportFlag |= OUTPUT_TOUCH_CONTROL_FLAG;
		
		IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,1);
		if(IO_ToggleStatusOnRAM(&ioRelay_2_Status))
		{
			nrf_gpio_pins_set(OUTPUT_2_MASK);
		}
		else
		{
			nrf_gpio_pins_clear(OUTPUT_2_MASK);
		}		
		
		err_code = app_timer_stop(m_btn_2_timer_id);
		APP_ERROR_CHECK(err_code);
		err_code = app_timer_start(m_btn_2_timer_id, BUTTON_CLICK_INTERVAL, NULL);
		APP_ERROR_CHECK(err_code);
	}
}


/**
 * @brief Handler for timer events.
 */
void button_3_update_event_handler(uint8_t status)
{  
	if(status)
	{
		IO_ToggleSetStatus(&io_led_red_1,3000,50,IO_TOGGLE_ENABLE,1);
		
		reportFlag |= OUTPUT_TOUCH_CONTROL_FLAG;
		
		IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,1);
		if(IO_ToggleStatusOnRAM(&ioRelay_3_Status))
		{
			nrf_gpio_pins_set(OUTPUT_3_MASK);
		}
		else
		{
			nrf_gpio_pins_clear(OUTPUT_3_MASK);
		}
	}
}

/**
 * @brief Handler for timer events.
 */
void proximity_1_update_event_handler(uint8_t status)
{  
//	if(status && CheckTimeout(&tStopCheckProximityTimeout) == SYSTICK_TIMEOUT)
//	{
//			IO_ToggleSetStatus(&io_buzzer,200,100,IO_TOGGLE_ENABLE,1);
//	}
}

void io_control_init(void)
{
	APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
	
	nrf_gpio_cfg_output(RELAY_1_PIN);
	nrf_gpio_cfg_output(RELAY_2_PIN);
	nrf_gpio_cfg_output(RELAY_3_PIN);
	nrf_gpio_cfg_output(RELAY_4_PIN);
	
	nrf_gpio_cfg_output(LED_GREEN_1);
	nrf_gpio_cfg_output(LED_GREEN_2);
	nrf_gpio_cfg_output(LED_GREEN_3);
	nrf_gpio_cfg_output(LED_GREEN_4);
	
	if(IO_ReadStatusOnRAM(&ioRelay_1_Status))
	{
		nrf_gpio_pins_set(OUTPUT_1_MASK);
	}
	else nrf_gpio_pins_clear(OUTPUT_1_MASK);
	
	if(IO_ReadStatusOnRAM(&ioRelay_2_Status))
	{
		nrf_gpio_pins_set(OUTPUT_2_MASK);
	}
	else nrf_gpio_pins_clear(OUTPUT_2_MASK);
	
	if(IO_ReadStatusOnRAM(&ioRelay_3_Status))
	{
		nrf_gpio_pins_set(OUTPUT_3_MASK);
	}
	else nrf_gpio_pins_clear(OUTPUT_3_MASK);
	
	if(IO_ReadStatusOnRAM(&ioRelay_4_Status))
	{
		nrf_gpio_pins_set(OUTPUT_4_MASK);
	}
	else nrf_gpio_pins_clear(OUTPUT_4_MASK);
}

void boards_init(void)
{
	uint32_t err_code;
	
