dvhai08/tuanvu_luanvan/nrf51822/nRF51_SDK_10.0.0 - Mesh/examples/ble_peripheral/iky_sswitch_3btn/main.c
	nrf_gpio_cfg_output(LED_BLUE_1);
	
	/* 1-channel PWM, 2KHz, output on DK LED pins. */
	app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(500L,BUZZER_PIN,LED_BLUE_1);
	/* Switch the polarity of the second channel. */
	pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;
    
	/* Initialize and enable PWM. */
	err_code = app_pwm_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
	APP_ERROR_CHECK(err_code);
	app_pwm_enable(&PWM1);
}

void timer_btn_1_event_handler(void* p_context)
{
	if(io_btn_1.updateHighCnt == 10)	
	{
		IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,5);
		bootModeFlag = BOOT_MODE_ACTIVE;		
	}
	io_btn_1.updateHighCnt = 0;
}

void timer_btn_2_event_handler(void* p_context)
{
	if(io_btn_2.updateHighCnt == 10)	
	{
		IO_ToggleSetStatus(&io_buzzer,50,100,IO_TOGGLE_ENABLE,5);
		bootModeFlag = BOOT_MODE_ACTIVE;
	}
	io_btn_2.updateHighCnt = 0;
}

void timer_systick_event_handler(void* p_context)
{
	SysTick___Task();
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
    err_code = app_timer_create(&m_touch_timer_id,APP_TIMER_MODE_REPEATED, timer_touch_event_handler);
    APP_ERROR_CHECK(err_code);
		err_code = app_timer_create(&m_btn_1_timer_id,APP_TIMER_MODE_SINGLE_SHOT, timer_btn_1_event_handler);
		APP_ERROR_CHECK(err_code);
		err_code = app_timer_create(&m_btn_2_timer_id,APP_TIMER_MODE_SINGLE_SHOT, timer_btn_2_event_handler);
		APP_ERROR_CHECK(err_code);
		err_code = app_timer_create(&m_systick_timer_id,APP_TIMER_MODE_REPEATED, timer_systick_event_handler);
		APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting application timers.
 */
void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_touch_timer_id, TOUCH_SCAN_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);	
		err_code = app_timer_start(m_systick_timer_id, SYSTICK_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


void ble_nus_send_task(void)
{
	uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
	uint8_t index = 0;
	static Timeout_Type tNusSendTimeout;
	uint8_t c;
	uint16_t i;
	uint32_t err_code;
	
	if(m_nus_xfer_done && CheckTimeout(&tNusSendTimeout) == SYSTICK_TIMEOUT) //send timeout
	{
		m_nus_xfer_done = false;
	}
	
	if(m_nus_xfer_done) return; //sending
		
	for(i=0;i<BLE_NUS_MAX_DATA_LEN;i++)
	{
		if(RINGBUF_Get(&IKYBLE_TxRingBuf,&c) == 0)
		{
			data_array[index] = c;
			index++;
		}
		else
		{
			 break; //data empty
		}
	}
	
	if (index)
	{
		NRF_LOG_PRINTF("ble nus send %d bytes ...",index);
		err_code = ble_nus_string_send(&m_nus, data_array,index);
		if(err_code == NRF_SUCCESS)
		{
			m_nus_xfer_done = true;
			NRF_LOG_PRINTF("success\r\n");
		}
		else
		{
			m_nus_xfer_done = false;
			NRF_LOG_PRINTF("fail %x\r\n",err_code);
		}
		
		if(m_nus_xfer_done) InitTimeout(&tNusSendTimeout,500);		
		index = 0;
	}
}

void led_proximity_set_state(uint8_t __led)
{
	uint8_t relay_status  = 0;
	LED_PROXIMITY_STATE newState = LED_PROXIMITY_OFF;
	
	if(IO_GetStatusOnRAM(ioRelay_1_Status)) relay_status |=  MESH_COMM_OUTPUT_1_MSK;
	if(IO_GetStatusOnRAM(ioRelay_2_Status)) relay_status |=  MESH_COMM_OUTPUT_2_MSK;
	if(IO_GetStatusOnRAM(ioRelay_3_Status)) relay_status |=  MESH_COMM_OUTPUT_3_MSK;
	if(IO_GetStatusOnRAM(ioRelay_4_Status)) relay_status |=  MESH_COMM_OUTPUT_4_MSK;
	
	if(__led)
	{
			newState = LED_PROXIMITY_ON;
	}
	else
	{
		if(relay_status) //Chỉ Tắt led proximity khi có ít nhất 1 relay bật
		{
				newState = LED_PROXIMITY_OFF;
		}	
		else
		{
				newState = LED_PROXIMITY_DIM;
		}
	}
		
	if(newState != ledProximityState)
	{
			ledProximityState = newState;
			if(ledProximityState == LED_PROXIMITY_ON) app_pwm_channel_duty_set(&PWM1, 1, 100);
			else if(ledProximityState == LED_PROXIMITY_DIM) app_pwm_channel_duty_set(&PWM1, 1, 5);
			else app_pwm_channel_duty_set(&PWM1, 1, 0);
	}
}
/** 
 * @}
 */
